var x = prompt('Накрылся комп? Не включается?');
if (x == 'нет') {
    alert ("Какого лешего припёрся в мастерскую?!")
}
else {
    x = prompt('Шнур в розетку пробовал вставить?')
    };
if (x == 'нет') {
    alert ("Ну так вставь и всё заработает")
}
else {
    x = prompt('Кнопку "POWER" нажимал?')
    };
if (x == 'нет') {
    alert ("Какой же ты балбес, нажимай скорее!")
}
else {
    x = prompt('Монитор загорелся?')
    };
if (x == 'нет') {
   alert ('Проверь подключение монитора к сети и нажата ли кнопка "POWER" на пониторе!'); 
   x = prompt('Проблема решена?') 
}
if (x == 'нет'){
    alert('Выбрось свои дрова в окно!')
}
else {
    alert('Приятной работы!')
}