var x = prompt('Накрылся комп? Не включается? да/нет');
if (x == 'нет') {
        alert("Какого лешего припёрся в мастерскую?!")
};
else if (x == 'да'){
   var y = prompt('Шнур в розетку пробовал вставить?')
};
else{
  alert('Уточните ответ!')  
};
    
if (y == 'нет'){
    alert("Ну так вставь и всё заработает")
};
else if (y == 'да') {
    var z = prompt('Кнопку "POWER" нажимал?')
    };

if (z == 'нет'){
    alert("Какой же ты балбес, нажимай скорее!")
   };
else if (z == 'да') {
        var xx = prompt('Монитор загорелся?')
};
if (xx === 'да'){
    alert("Приятной работы!")
};
else if (xx == 'нет') {   
alert ('Проверь подключение монитора к сети и нажата ли кнопка "POWER" на мониторе!'); 
var xy = prompt('Проблема решена?')
};
if (xy == 'да'){
    alert("Приятной работы!")
};
else if (xy == 'нет'){
alert('Выбрось свои дрова в окно!') 
};

//else{
//  alert('Уточните ответ!')  
//}
    
  

 




 
